{
  "ConsenSys": "ConsenSys owns MetaMask — Ramp's single biggest integration partner. We already process transactions for their users daily. We need someone senior enough to assess whether bringing Ramp in-house fits their roadmap, especially as they prepare for an IPO where owning the full fiat-to-crypto stack strengthens the narrative.",

  "Block (Square)": "Block reviewed our materials, asked detailed diligence questions, and we answered them all — then went completely silent. Our current contacts stopped responding. We need a path to someone more senior who can re-engage the conversation. The strategic fit is clear: Block is building a vertically integrated crypto stack (Bitkey, Cash App Bitcoin), and Ramp fills the on/off-ramp gap.",

  "Nubank": "Nubank is the largest digital bank in Latin America with 100M+ customers and has been expanding into crypto. Ramp already has a Brazil entity and holds LatAM licenses including PIX and SPEI — exactly what Nubank would need to build or buy to offer crypto on/off ramp to their base. We've never been able to get past the initial gatekeeper.",

  "Shopify": "Clear Street sent teaser on Jan 8 and has followed up three times since with no response. Crypto payments and stablecoin checkout for Shopify's merchant base is a natural next step — and Ramp is the infrastructure that makes it work. A warm intro could open a conversation that cold outreach simply hasn't.",

  "Klarna": "Clear Street sent teaser on Jan 7, following up since. Klarna is building a financial super-app and crypto is a missing piece. Adding on/off-ramp capability would let their users buy, hold, and spend crypto alongside traditional payments — a differentiator in the BNPL space. We had early contact in March 2025 but it stalled.",

  "Wise": "Clear Street sent teaser on Jan 8 after earlier attempts stalled. Wise moves money across borders for millions of people — crypto-based corridors are the obvious next step and dramatically cheaper for many routes. Wise's founders are Ramp investors, but that connection hasn't opened the door to the product or strategy team. We need a different angle in.",

  "Visa": "We had an in-person meeting with Cuy Sheffield (Visa crypto lead) on November 3, 2025 — good signal, real engagement. Then it went quiet. Clear Street sent teaser on Jan 8 and has followed up four times since. Cuy turned out not to be the M&A decision maker. We'd welcome other intros to Visa's M&A or strategy team who can sponsor next steps.",

  "PayPal": "We have an active partnership track with PayPal around PYUSD, but the broader strategic conversation needs a senior sponsor. December meetings confirmed: previous contacts turned out to be the wrong level for M&A decisions. Founder intro was promised but pending. <strong>Only flag this if your connection is genuinely senior</strong> — VP+ in crypto product or corporate strategy.",

  "Stripe": "Stripe is aggressively moving into crypto — they acquired Bridge and are building stablecoin infrastructure. Ramp's on/off-ramp rails, licenses, and distribution are a natural fit for their stack. We have zero engagement so far despite an intro being promised in December 2025. This is the single biggest unlock on the list.",

  "Mastercard": "Mastercard has been running active crypto pilot programs and investing in digital asset infrastructure. Ramp's licensed, multi-currency on/off-ramp would let them offer fiat-to-crypto across their network without building it from scratch. We currently have no path into their digital assets or M&A team.",

  "Adyen": "Clear Street sent teaser on Jan 8 after earlier attempts went unanswered. We reached out about a stablecoin strategy angle in October 2025 through Szymon directly, but multiple follow-ups since January have gone unanswered. A warm intro that bypasses the cold outreach inbox could get this in front of the right people.",

  "SumUp": "SumUp is a European payments company on an IPO track that has been actively acquisitive. Stablecoin settlement and crypto payouts for their SME merchant base is a natural extension. We haven't made contact yet — a warm intro at the leadership level would let us open this before their IPO priorities lock in.",

  "Plaid": "Clear Street sent teaser on Jan 8 after earlier approaches stalled. Plaid connects apps to bank accounts — adding crypto wallet and on/off-ramp connectivity is a natural extension of their infrastructure. We reached out about a stablecoin strategy angle in October 2025 but got no traction. A warm intro to corp dev or partnerships would reopen this.",

  "Tether": "Tether is the largest stablecoin issuer and is expanding into new verticals. Owning on/off-ramp infrastructure gives them a direct fiat gateway for USDT — reducing dependency on third parties. Notoriously hard to reach. We've tried multiple intro attempts since October 2025 including through Jakub Zakrzewski to VP Global Expansion Marco Dal Lago — still no movement. Even an indirect path would help.",

  "MoneyGram": "MoneyGram is already crypto-forward — they've partnered with Stellar and Ripple. Ramp's on/off-ramp infrastructure fits their strategy of bridging traditional remittances with digital assets. We sent a teaser through Clear Street in late 2025 and followed up six-plus times with no response. A warm intro could break through where cold outreach hasn't.",

  "BitGo": "BitGo provides institutional-grade digital asset custody and wants to expand and verticalize. Adding on/off-ramp capability would let their clients move between fiat and crypto without leaving BitGo's ecosystem — a clear value-add. We haven't yet been able to reach them through a warm intro. A personal connection to the founder or senior strategy team would open the door.",

  "Trade Republic": "Trade Republic is one of Europe's largest investment platforms and already offers crypto trading. Ramp's licensed infrastructure, wallet stack, and on/off-ramp rails would let them deepen their crypto offering without building regulated infrastructure from scratch. An introduction was sourced in November 2025 but has been idle since. A warm push could activate this.",

  "SoFi": "SoFi offers banking, investing, and crypto through a single app — adding licensed on/off-ramp infrastructure would strengthen their crypto stack significantly. We had engagement through Clear Street and SoFi asked to reschedule a call in December 2025, then went silent despite multiple follow-ups. A warm intro could re-prioritize this internally.",

  "Payoneer": "Payoneer moves money cross-border for millions of freelancers and businesses. Crypto-based corridors and stablecoin settlement are a clear cost and speed advantage for their core use case. Ramp's licenses and rails are exactly what they'd need to offer this. Clear Street has been following up since November 2025 with no response — a warm intro could reopen at the right level.",

  "Worldline": "Worldline is one of Europe's largest payment processors and has been actively acquisitive. Crypto settlement and stablecoin rails for their merchant base is a natural extension. Clear Street sent a teaser and followed up multiple times since January 2026 with no response. A warm intro could get this past the inbox.",

  "Phantom": "Phantom is the leading crypto wallet with millions of users across Solana, Ethereum, and Bitcoin. Owning on/off-ramp infrastructure would let them control the full stack — from fiat to wallet to DeFi — instead of relying on third-party providers. <strong>Only flag this if you have a genuinely close relationship with one of the co-founders (Brandon Millman, Chris Kalani, Francesco Agosti).</strong> A cold or loose connection won't work here."
}
